Data frame

In [1]:
import numpy  as np

import pandas as pd

student = pd.DataFrame({
    'Name': ['Tareq', 'Ali', 'Sara', 'Hassan', 'Hanan', 'Hadi','alamin','sakil','sabbir'],
    'Age': [20, 21, 22, 23, 24, 25,26,27,28],
    'id': [1, 2, 3, 4, 5, 6,7,8,9],
    'GPA': [3.5, 3.6, 3.7, 3.8, 3.9, 4.0,4.1,4.2,4.3],
    'Department': ['CSE', 'EEE', 'BBA', 'CSE', 'EEE', 'BBA','CSE','EEE','BBA']})
print(student)

     Name  Age  id  GPA Department
0   Tareq   20   1  3.5        CSE
1     Ali   21   2  3.6        EEE
2    Sara   22   3  3.7        BBA
3  Hassan   23   4  3.8        CSE
4   Hanan   24   5  3.9        EEE
5    Hadi   25   6  4.0        BBA
6  alamin   26   7  4.1        CSE
7   sakil   27   8  4.2        EEE
8  sabbir   28   9  4.3        BBA

In [2]:
student.head(3)

    Name  Age  id  GPA Department
0  Tareq   20   1  3.5        CSE
1    Ali   21   2  3.6        EEE
2   Sara   22   3  3.7        BBA

In [3]:
student.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        9 non-null      object
 1   Age         9 non-null      int64
 2   id          9 non-null      int64
 3   GPA         9 non-null      float64
 4   Department  9 non-null      object
dtypes: float64(1), int64(2), object(2)
memory usage: 492.0+ bytes

In [4]:
student.describe()

             Age        id       GPA
count   9.000000  9.000000  9.000000
mean   24.000000  5.000000  3.900000
std     2.738613  2.738613  0.273861
min    20.000000  1.000000  3.500000
25%    22.000000  3.000000  3.700000
50%    24.000000  5.000000  3.900000
75%    26.000000  7.000000  4.100000
max    28.000000  9.000000  4.300000

In [8]:
value = student.values
print(value)

[['Tareq' 20 1 3.5 'CSE']
 ['Ali' 21 2 3.6 'EEE']
 ['Sara' 22 3 3.7 'BBA']
 ['Hassan' 23 4 3.8 'CSE']
 ['Hanan' 24 5 3.9 'EEE']
 ['Hadi' 25 6 4.0 'BBA']
 ['alamin' 26 7 4.1 'CSE']
 ['sakil' 27 8 4.2 'EEE']
 ['sabbir' 28 9 4.3 'BBA']]

In [10]:
student['Name'] = student['Name'].str.upper()
print(student['Name'])

0     TAREQ
1       ALI
2      SARA
3    HASSAN
4     HANAN
5      HADI
6    ALAMIN
7     SAKIL
8    SABBIR
Name: Name, dtype: object

In [12]:
student['Name'] = student['Name'].str.lower()
print(student['Name'])

0     tareq
1       ali
2      sara
3    hassan
4     hanan
5      hadi
6    alamin
7     sakil
8    sabbir
Name: Name, dtype: object

Rename student columns

In [ ]:

student.rename(columns={'Name': 'Student Name', 'Age': 'Student Age'})
print(student.columns)
student.head(3)

Index(['Student Name', 'Student Age', 'ID(Roll)', 'GPA', 'Department'], dtype='object')

  Student Name  Student Age  ID(Roll)  GPA Department
0        tareq           20         1  3.5        CSE
1          ali           21         2  3.6        EEE
2         sara           22         3  3.7        BBA